/**************************************************************************************************
	Title			: PIC24F Series DAC Driver
	Programmer		: Yosuke FURUSAWA.
	Copyright		: Copyright (C) 2010 Yosuke FURUSAWA.
	License			: 4-clause BSD License
	Since			: 2010/05/22

	Filename		: libdac.h
	Last up date	: 2010/05/23
	Kanji-Code		: Shift-JIS
	TAB Space		: 4

	Note			: Single Channel Output
**************************************************************************************************/


#ifndef _LIBDAC_H_
#define _LIBDAC_H_


/*================================================================================================
マクロ定義
=================================================================================================*/
/* DACの方式 */
//#define DAC_STANDARD								/* CVREFによる 4bit DAC */
//#define DAC_PWM									/* アウトプットコンペアによる 8bit PWM DAC */
#define DAC_STDPWM									/* CVREF + PWMによる 8bit DAC. 苦しい... */


/*================================================================================================
構造体宣言
=================================================================================================*/
extern unsigned char dac;


/*================================================================================================
プロトタイプ宣言
=================================================================================================*/
extern void DAC_init(void);
extern  void DAC_setvalue(unsigned char buf);


#endif
