/**************************************************************************************************
	Title			: PIC24F Series DAC Driver
	Programmer		: Yosuke FURUSAWA
	Copyright		: Copyright (C) 2010 Yosuke FURUSAWA.
	License			: 4-clause BSD License
	Since			: 2010/05/22

	Filename		: libdac.c
	Last up date	: 2010/05/23
	Kanji-Code		: Shift-JIS
	TAB Space		: 4

	Note			: Single Channel Output
**************************************************************************************************/


/*================================================================================================
ヘッダファイルをインクルード
=================================================================================================*/
#include <p24FJ64GA002.h>

#include "types.h"

#include "librtc.h"
#include "libdac.h"


/*=================================================================================================
マクロ定義
=================================================================================================*/


/*=================================================================================================
グローバル変数
=================================================================================================*/
unsigned char dac = 0;


/*=================================================================================================
プロトタイプ宣言
=================================================================================================*/


/**************************************************************************************************
DAC 初期化
**************************************************************************************************/
void DAC_init(void)
{
	dac = 0;

#if defined(DAC_STANDARD)
	/* 内蔵 4bit DAC : 精度が悪くて、思ったよりも全然使い物にならない... */
	CVRCON = 0b0000000011100000;


#elif defined(DAC_PWM)
	/* PWMを想定して回路を設計していなかったので、出力が非線形すぎて使い物にならない (^^; */
	OC5CON = 0b0000000000000110;
	RPOR7bits.RP14R = 22;

#elif defined(DAC_STDPWM)
	/* 内蔵 4bit DACを使って、PWM風に精度を拡張してみる... (^^;;; */
	CVRCON = 0b0000000011100000;

	/* Timer2に寄生する */
	OC4R   = 0x0001;
	OC4CON = 0b0000000000000001;
	IPC6bits.OC4IP = 5;
	IEC1bits.OC4IE = 1;
	IFS1bits.OC4IF = 0;

	OC5R   = PR2 >> 1;						/* 50% Duty */
	OC5CON = 0b0000000000000001;
	IPC10bits.OC5IP = 5;
	IEC2bits.OC5IE  = 1;
	IFS2bits.OC5IF  = 0;

#endif

	DAC_setvalue(0x80);
	return;
}


/**************************************************************************************************
DAC出力設定
**************************************************************************************************/
 void DAC_setvalue(unsigned char buf)
{
	dac = buf;

#if defined(DAC_STANDARD)
	CVRCONbits.CVR = dac >> 4;

#elif defined(DAC_PWM)
	OC5RS = (long)((long)dac * (long)PR2) >> 8;

#elif defined(DAC_STDPWM)
	OC5R  = (((dac & 0x0f) * PR2) >> 4) + 2;

#endif

	return;
}


/**************************************************************************************************
CVREFと OC4/5を使った PWMで精度を拡張
**************************************************************************************************/
#if defined(DAC_STDPWM)

void __attribute__((interrupt, auto_psv)) _OC4Interrupt(void)
{
	IFS1bits.OC4IF = 0;
	CVRCONbits.CVR = dac >> 4;
	OC4CON = 0b0000000000000001;
	return;
}

void __attribute__((interrupt, auto_psv)) _OC5Interrupt(void)
{
	IFS2bits.OC5IF = 0;
	CVRCONbits.CVR--;
	OC5CON = 0b0000000000000001;
	return;
}

#endif


